Autodesk.Revit.DB.ElementDesignOptionFilter.#ctor(Autodesk.Revit.DB.ElementId,System.Boolean)
Constructs a new instance of a filter to match elements contained within a particular design option, with the option to invert the filter and find elements not contained within a particular design option.
designOptionId:
The design option id to match.
inverted:
True if the filter should match all elements which are not contained within a particular design option.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.ElementDesignOptionFilter.#ctor(Autodesk.Revit.DB.ElementId)
Constructs a new instance of a filter to match elements contained within a particular design option.
designOptionId:
The design option id to match.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011